app/controllers/api/v1/services_controller.rb

SELECT "products"."service_code", "products"."sku", "products"."from_location" FROM "products" WHERE "products"."from_location" = ? AND (DATE(created_at) = '2019-12-12' )  [["from_location", "India"]]
---
  def region
    render json: {code: 404, message: 'Records not found'}, status: 404 and return unless params[:region].present?
    products = Product.select(:service_code, :sku, :from_location).where(from_location: params[:region])